app/controllers/api/events_controller.rb

SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."url" = ? LIMIT 1  [["url", "http://registered_application.com"]]
INSERT INTO "events" ("name", "registered_application_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "foobar"], ["registered_application_id", 7], ["created_at", "2015-10-08 10:02:18.871021"], ["updated_at", "2015-10-08 10:02:18.871021"]]
---
  def create
    registered_application = RegisteredApplication.find_by(url: request.env['HTTP_ORIGIN'])

    if registered_application.nil?
      render json: { error: "missing valid registered application URL" }, status: :unprocessable_entity
    else
      @event = registered_application.events.build( event_params )
      if @event.save