app/views/registered_applications/destroy.js.erb

<% if @registered_application.destroyed? %>
---
DELETE FROM "registered_applications" WHERE "registered_applications"."id" = ?  [["id", 1]]