app/views/registered_applications/show.html.erb

      <script src="chartkick.js"></script>
      <%= pie_chart @registered_application.events.group(:name).count %>
---
SELECT "events".* FROM "events" WHERE "events"."registered_application_id" = ?  [["registered_application_id", 6]]
SELECT COUNT(*) AS count_all, page load AS page_load FROM "events" WHERE "events"."registered_application_id" = ? GROUP BY page load  [["registered_application_id", 9]]