app/controllers/registered_applications_controller.rb

  def index
    @registered_applications = RegisteredApplication.all
---
SELECT "registered_applications".* FROM "registered_applications"

  def show
    @registered_application = RegisteredApplication.find(params[:id])
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @registered_application = RegisteredApplication.find(params[:id])
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @registered_application = RegisteredApplication.new( registered_application_params.merge( user_id: current_user.id ) )
    authorize @registered_application

    if @registered_application.save
---
INSERT INTO "registered_applications" ("name", "url", "users_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "CNN"], ["url", "http://www.cnn.com"], ["users_id", 5], ["created_at", "2015-10-08 07:20:55.677366"], ["updated_at", "2015-10-08 07:20:55.677366"]]

  def update
    @registered_application = RegisteredApplication.find(params[:id])
    authorize @registered_application

    if @registered_application.update_attributes( registered_application_params )
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "registered_applications" SET "name" = ? WHERE "registered_applications"."id" = ?  [["name", "FIFA2"], ["id", 6]]

  def destroy
    @registered_application = RegisteredApplication.find(params[:id])
    name = @registered_application.name
    authorize @registered_application

    if @registered_application.destroy
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "registered_applications" WHERE "registered_applications"."id" = ?  [["id", 1]]